Router: 
    Router(config)#line vty [CONNECTION PORTS TO THE ROUTER]
    Router(config-line)#password [PASSWORD HERE]
    Router(config-line)#login
    Router(config-line)#end

Switch:
    Switch(config)#line vty [CONNECTION PORTS TO THE SWITCH]
    Switch(config-line)#password [PASSWORD HERE]
    Switch(config-line)#login

Multilayer Switch:
    Switch(config)#line vty [CONNECTION PORTS TO THE SWITCH]
    Switch(config-line)#password [PASSWORD HERE]
    Switch(config-line)#login

Example:
    Router: 
        Router(config)#line vty 0 4
        Router(config-line)#password cisco
        Router(config-line)#login

    Switch:
        Switch(config)#line vty 0 5
        Switch(config-line)#password qwe123
        Switch(config-line)#login

    Multilayer Switch:
        Switch(config)#line vty 0 15
        Switch(config-line)#password UngaBunga
        Switch(config-line)#login

Tips:
    The abstract “0 – 4” means that the device can allow 5 simultaneous virtual connections which may be Telnet or SSH.
    For Example:
        Device(config)#line vty 0 4    = 5 connections
        Device(config)#line vty 0 5    = 6 connections
        Device(config)#line vty 0 8    = 9 connections
